; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph2 - mode
	image1 - mode
	infrared0 - mode
	Star6 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation8 - direction
	Star4 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 image1)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(pointing satellite1 Planet12)
	(have_image Star10 infrared0)
	(have_image Planet11 image1)
	(have_image Planet12 image1)
	(have_image Star13 spectrograph2)
	(have_image Planet14 image1)
	(have_image Planet15 infrared0)
	(have_image Star16 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 star10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star10)
   goals met: 0 of 8
5. (take_image satellite1 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 1 of 8
6. (turn_to satellite1 planet15 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet15)
   goals met: 1 of 8
7. (take_image satellite1 planet15 instrument3 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 2 of 8
8. (turn_to satellite1 planet14 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet14)
   goals met: 2 of 8
9. (take_image satellite1 planet14 instrument3 image1)
   added: (have_image planet14 image1)
   goals met: 3 of 8
10. (turn_to satellite1 planet11 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet11)
   goals met: 3 of 8
11. (take_image satellite1 planet11 instrument3 image1)
   added: (have_image planet11 image1)
   goals met: 4 of 8
12. (turn_to satellite1 star13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star13)
   goals met: 4 of 8
13. (take_image satellite1 star13 instrument3 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 5 of 8
14. (turn_to satellite1 star16 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star16)
   goals met: 5 of 8
15. (take_image satellite1 star16 instrument3 infrared0)
   added: (have_image star16 infrared0)
   goals met: 6 of 8
16. (turn_to satellite1 planet12 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 planet12)
   goals met: 7 of 8
17. (take_image satellite1 planet12 instrument3 image1)
   added: (have_image planet12 image1)
   goals met: 8 of 8
